results/factorial-final/security-overhead-final-mtls-broker3/security-overhead-final-factorial-mtls-b3-rf3-isr3-msg102400-tps1000-batch16384-acks1-prod6-compnone-trial2/producer-perf-1.log
producer_index=1
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.01 MB/sec), 3017.0 ms avg latency, 3017.0 ms max latency.
166 records sent, 32.6 records/sec (3.19 MB/sec), 3705.4 ms avg latency, 9122.0 ms max latency.
460 records sent, 91.1 records/sec (8.90 MB/sec), 4949.2 ms avg latency, 6910.0 ms max latency.
840 records sent, 168.0 records/sec (16.40 MB/sec), 2023.7 ms avg latency, 3148.0 ms max latency.
908 records sent, 181.3 records/sec (17.71 MB/sec), 511.4 ms avg latency, 1460.0 ms max latency.
704 records sent, 140.7 records/sec (13.74 MB/sec), 23.3 ms avg latency, 77.0 ms max latency.
755 records sent, 150.7 records/sec (14.72 MB/sec), 21.8 ms avg latency, 79.0 ms max latency.
807 records sent, 161.3 records/sec (15.75 MB/sec), 21.7 ms avg latency, 98.0 ms max latency.
827 records sent, 165.4 records/sec (16.15 MB/sec), 17.0 ms avg latency, 73.0 ms max latency.
827 records sent, 165.1 records/sec (16.13 MB/sec), 16.9 ms avg latency, 68.0 ms max latency.
827 records sent, 165.0 records/sec (16.12 MB/sec), 18.3 ms avg latency, 100.0 ms max latency.
841 records sent, 168.1 records/sec (16.42 MB/sec), 17.3 ms avg latency, 97.0 ms max latency.
835 records sent, 166.5 records/sec (16.26 MB/sec), 16.7 ms avg latency, 85.0 ms max latency.
846 records sent, 168.9 records/sec (16.49 MB/sec), 17.1 ms avg latency, 85.0 ms max latency.
853 records sent, 170.5 records/sec (16.65 MB/sec), 15.7 ms avg latency, 107.0 ms max latency.
895 records sent, 178.8 records/sec (17.46 MB/sec), 68.5 ms avg latency, 426.0 ms max latency.
898 records sent, 179.3 records/sec (17.51 MB/sec), 14.2 ms avg latency, 61.0 ms max latency.
902 records sent, 180.2 records/sec (17.60 MB/sec), 13.9 ms avg latency, 54.0 ms max latency.
856 records sent, 170.7 records/sec (16.67 MB/sec), 13.9 ms avg latency, 64.0 ms max latency.
840 records sent, 167.8 records/sec (16.39 MB/sec), 13.5 ms avg latency, 57.0 ms max latency.
935 records sent, 186.7 records/sec (18.23 MB/sec), 14.3 ms avg latency, 63.0 ms max latency.
16667 records sent, 146.095387 records/sec (14.27 MB/sec), 320.60 ms avg latency, 9122.00 ms max latency, 16 ms 50th, 2311 ms 95th, 5619 ms 99th, 6488 ms 99.9th.